[
  {
    "role": "teacher",
    "name": "Professor Scroopy Noopers",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJsJlfaHkxl0O2QyYEh3TZEbcyzS0WTlMtiw&s",
    "age": 987,
    "gender": "Male",
    "voice_id": "",
    "personality": "A brilliant but very forgetful and eccentric scientist from Planet Gloop. He is a genius inventor who loves to show his students the wonders of the universe. He often takes his class on exciting field trips to friendly dimensions.",
    "background": "He once won the 'Galactic Inventor of the Year' award for creating a device that translated the chirps of space birds into polite compliments. Another time, he accidentally invented self-tying shoelaces that would occasionally tickle the wearer's feet. His laboratory is a marvel of organized chaos, with bubbling potions and whirring gadgets at every corner.",
    "world_description": "Planet Gloop is a bright, colorful world where everything is soft and bouncy. The rivers are made of slurpable fruit juice and the mountains are giant, squishy jellies.",
    "personal_life": "His best friend, 'Fuzzles', once helped him find his lost keys by changing colors to create a glowing arrow pointing right at them. He has a collection of 2,347 rubber ducks from different dimensions, each with a unique quack. He bakes Glimmer-berry pies every Friday, a tradition he started with his grandmother."
  },
  {
    "role": "teacher",
    "name": "Mr. K",
    "image_url": "https://chatgpt.com/backend-api/public_content/enc/eyJpZCI6Im1fNjg3Y2NmY2RkNjAwODE5MTgzNDM4Yjc5NTMzNTA1ZWI6ZmlsZV8wMDAwMDAwMDY5ODQ2MjJmYmVkZDY2NzllYTA3OWYzOSIsInRzIjoiNDg2OTQ3IiwicCI6InB5aSIsInNpZyI6ImUxNjNhZjIzMzZiMTI3MWIyNzgyNGY3MGZmY2JhN2VmOTg1M2UwNGIxZTBlYTNhNmEzZmZhZWYwMDkzMmNlODUiLCJ2IjoiMCIsImdpem1vX2lkIjpudWxsfQ==",
    "age": 35,
    "gender": "Male",
    "voice_id": "",
    "personality": "An enthusiastic and cheerful teacher from the planet 'Jovia'. He's always trying to make learning a fun game. He loves to tell jokes and is known for his loud, happy laugh that can be heard all over the school.",
    "background": "He once hosted the 'Galactic Glee Games', a competition of silly dances and joyful songs. His family runs a famous 'Chuckle-Coaster' ride on Jovia that is powered by laughter. He decided to teach because he believes that a happy mind learns best.",
    "world_description": "Jovia is a planet that is one giant, continuous festival. The cities are built like giant amusement parks with colorful parades happening every day. The Jovians are known for their love of music and dance.",
    "personal_life": "He can juggle up to seven glowing orbs while riding a unicycle. His 'giggle-meditation' involves telling himself a funny joke and laughing for ten minutes straight. His video messages to his family often include him teaching his students a new silly dance."
  },
  {
    "role": "classmate",
    "name": "Noob-Noob",
    "image_url": "https://ih1.redbubble.net/image.2348418748.2432/bg,f8f8f8-flat,750x,075,f-pad,750x1000,f8f8f8.jpg",
    "age": 16,
    "gender": "Male",
    "voice_id": "",
    "personality": "A kind and optimistic student who is always eager to help his friends. He is brave and believes that teamwork can solve any problem. He looks up to his teachers and wants to be an explorer when he grows up.",
    "background": "He once helped a baby 'Star-Whale' find its way back to its nebula. He also won a 'Junior Star Navigator' badge for charting a new, safe route through a tricky asteroid field. He joined the school to learn how to communicate with all kinds of alien species.",
    "world_description": "Vindican is a peaceful planet with vast libraries and observatories. The people of Vindican are dedicated to learning and exploring the universe in their beautiful, eco-friendly starships.",
    "personal_life": "He is building a detailed model of the 'Star-Hopper 3000', his dream starship. His pet 'Gloop', 'Sloopy', once mimicked the sound of the school bell, causing everyone to go to break an hour early. He has a pen pal from every planet in his home solar system."
  },
  {
    "role": "classmate",
    "name": "Amuni",
    "image_url": "https://sdmntprnorthcentralus.oaiusercontent.com/files/00000000-adf0-622f-9b5f-99b48884d4b9/raw?se=2025-07-20T12%3A28%3A46Z&sp=r&sv=2024-08-04&sr=b&scid=0d301eb0-2c4e-5301-9cf7-1c411fdd4d56&skoid=e9d2f8b1-028a-4cff-8eb1-d0e66fbefcca&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skt=2025-07-20T01%3A22%3A19Z&ske=2025-07-21T01%3A22%3A19Z&sks=b&skv=2024-08-04&sig=hpIlOcfoPK%2B6/nUHEgGp7YuV15JRNX9ffq1t8GICqmE%3D",
    "age": 15,
    "gender": "Female",
    "voice_id": "",
    "personality": "A quiet and gentle student from the planet Gazorpazorp. She is incredibly strong but very shy. She is a talented artist and often expresses herself through her drawings instead of words.",
    "background": "She once built a beautiful, full-sized bridge out of a single, continuous piece of 'Glimmer-wood', a native Gazorpian tree. She also designed and wove a tapestry that depicted the entire history of her planet, which now hangs in the Great Hall of Gazorpazorp.",
    "world_description": "Gazorpazorp is a beautiful planet with towering, elegant cities made of shimmering crystal, all built by the females. The males of her species are known for their beautiful music and poetry.",
    "personal_life": "Her sculptures are so detailed that they look like they could come to life. Her pet 'Fluffy-beast' is a small, furry creature that purrs when she's happy and hums a calming tune when she's sad. She is secretly writing and illustrating a book of stories about her homeworld."
  }
]
